In [ ]:
NAME: CHEEDELLA YASASVI

In [ ]:
USN: 21BTRCD033

In [ ]:
BRANCH: CSE-Data Science

In [ ]:
#creating dataset

In [83]:
#Create a Dataset Of your Own school, Such that you are analysing dataset & its different variables using pandas methods.Also use dropna(), fillna(mean,median,mode), Encoding techniques-replace(),category().get_dummies,Sklearn-ordinalencoder().

In [2]:
import pandas as pd

In [3]:
import numpy as np

In [4]:
d=pd.read_excel("stress2.xlsx")

In [5]:
df=pd.DataFrame(d)

In [6]:
df

  school Area  no of boys no of girls     Age Electricity_bill
0        1000           3           2      15              100
1        1900           3           2      10              110
2        2300           4           3      18           np.nan
3        1700           2           2  np.nan              120
4      np.nan           2           1       6               90
5        2900           3           2       4              130
6        5600           2           1      16               80
7        1100           4           3      15              140
8        1300           3      np.nan      14               95
9        2400           3           2      13              115

In [7]:
#Dropping null values using dropna()

In [8]:
std=df.dropna()

In [9]:
std

  school Area  no of boys no of girls     Age Electricity_bill
0        1000           3           2      15              100
1        1900           3           2      10              110
2        2300           4           3      18           np.nan
3        1700           2           2  np.nan              120
4      np.nan           2           1       6               90
5        2900           3           2       4              130
6        5600           2           1      16               80
7        1100           4           3      15              140
8        1300           3      np.nan      14               95
9        2400           3           2      13              115

In [10]:
#filling all nul values

In [11]:
x=df["no of boys"].mean()

In [12]:
x

2.9

In [13]:
d1=df.fillna(x)

In [14]:
d1

  school Area  no of boys no of girls     Age Electricity_bill
0        1000           3           2      15              100
1        1900           3           2      10              110
2        2300           4           3      18           np.nan
3        1700           2           2  np.nan              120
4      np.nan           2           1       6               90
5        2900           3           2       4              130
6        5600           2           1      16               80
7        1100           4           3      15              140
8        1300           3      np.nan      14               95
9        2400           3           2      13              115

In [15]:
y=df["no of boys"].mode()

In [16]:
y

0    3
Name: no of boys, dtype: int64

In [17]:
d2=df.fillna(y)

In [18]:
d2

  school Area  no of boys no of girls     Age Electricity_bill
0        1000           3           2      15              100
1        1900           3           2      10              110
2        2300           4           3      18           np.nan
3        1700           2           2  np.nan              120
4      np.nan           2           1       6               90
5        2900           3           2       4              130
6        5600           2           1      16               80
7        1100           4           3      15              140
8        1300           3      np.nan      14               95
9        2400           3           2      13              115

In [19]:
z=df["no of boys"].median()

In [20]:
z

3.0

In [21]:
d3=df.fillna(z)

In [22]:
d3

  school Area  no of boys no of girls     Age Electricity_bill
0        1000           3           2      15              100
1        1900           3           2      10              110
2        2300           4           3      18           np.nan
3        1700           2           2  np.nan              120
4      np.nan           2           1       6               90
5        2900           3           2       4              130
6        5600           2           1      16               80
7        1100           4           3      15              140
8        1300           3      np.nan      14               95
9        2400           3           2      13              115

In [23]:
# replace the values using replace() method

In [24]:
d4=df.replace(3,6)

In [25]:
print(d4)

  school Area  no of boys no of girls     Age Electricity_bill
0        1000           6           2      15              100
1        1900           6           2      10              110
2        2300           4           6      18           np.nan
3        1700           2           2  np.nan              120
4      np.nan           2           1       6               90
5        2900           6           2       4              130
6        5600           2           1      16               80
7        1100           4           6      15              140
8        1300           6      np.nan      14               95
9        2400           6           2      13              115

In [26]:
d5 = pd.Categorical([1,2,4,1,2,5,1,2,3,])

In [27]:
print(d5)

[1, 2, 4, 1, 2, 5, 1, 2, 3]
Categories (5, int64): [1, 2, 3, 4, 5]

In [28]:
d6 = pd.Categorical(['a','b','e', 'm', 'f', 'i', 'f', 'e', 'h', 'm' ])

In [29]:
print(d6)

['a', 'b', 'e', 'm', 'f', 'i', 'f', 'e', 'h', 'm']
Categories (7, object): ['a', 'b', 'e', 'f', 'h', 'i', 'm']

In [33]:
dd=pd.read_excel("movies1.xlsx")

In [34]:
df=pd.DataFrame(dd)

In [35]:
df

   s.no    name qualifier
0     1   jithu      fail
1     2  ismail      pass
2     3  rajesh      pass
3     4  naveen      fail

In [36]:
df.head()

   s.no    name qualifier
0     1   jithu      fail
1     2  ismail      pass
2     3  rajesh      pass
3     4  naveen      fail

In [37]:
df["qualifier"].value_counts()

fail    2
pass    2
Name: qualifier, dtype: int64

In [39]:
encode={"qualifier":{"pass":1,"fail":0}}

In [40]:
encoded_df=df.replace(encode)

In [42]:
encoded_df

   s.no    name  qualifier
0     1   jithu          0
1     2  ismail          1
2     3  rajesh          1
3     4  naveen          0

In [44]:
output=encoded_df.to_excel("data.xlsx")

In [45]:
pd.read_excel("data.xlsx")

   Unnamed: 0  s.no    name  qualifier
0           0     1   jithu          0
1           1     2  ismail          1
2           2     3  rajesh          1
3           3     4  naveen          0

In [46]:
df.head()

   s.no    name qualifier
0     1   jithu      fail
1     2  ismail      pass
2     3  rajesh      pass
3     4  naveen      fail

In [47]:
data=pd.read_excel("movies1.xlsx")

In [48]:
data.head(7)

   s.no    name qualifier
0     1   jithu      fail
1     2  ismail      pass
2     3  rajesh      pass
3     4  naveen      fail

In [49]:
type(data["qualifier"])

pandas.core.series.Series

In [50]:
data.dtypes

s.no          int64
name         object
qualifier    object
dtype: object

In [51]:
data["qualifier"]=data["qualifier"].astype('category')

In [52]:
data.dtypes

s.no            int64
name           object
qualifier    category
dtype: object

In [53]:
data["qualifier_new"]=data["qualifier"].cat.codes

In [54]:
data

   s.no    name qualifier  qualifier_new
0     1   jithu      fail              0
1     2  ismail      pass              1
2     3  rajesh      pass              1
3     4  naveen      fail              0

In [55]:
""" 
create a dataset of home 
sno.rooms doors windows
1 dinning two four
"""

' \ncreate a dataset of home \nsno.rooms doors windows\n1 dinning two four\n'

In [56]:
pd.get_dummies(data,columns=["qualifier"]).head()

   s.no    name  qualifier_new  qualifier_fail  qualifier_pass
0     1   jithu              0               1               0
1     2  ismail              1               0               1
2     3  rajesh              1               0               1
3     4  naveen              0               1               0

In [57]:
from sklearn.preprocessing import OrdinalEncoder

In [59]:
obj=OrdinalEncoder()

In [60]:
data["encode"]=obj.fit_transform(data[["qualifier"]])

In [61]:
data.head(7)

   s.no    name qualifier  qualifier_new  encode
0     1   jithu      fail              0     0.0
1     2  ismail      pass              1     1.0
2     3  rajesh      pass              1     1.0
3     4  naveen      fail              0     0.0

In [62]:
data.value_counts

<bound method DataFrame.value_counts of    s.no    name qualifier  qualifier_new  encode
0     1   jithu      fail              0     0.0
1     2  ismail      pass              1     1.0
2     3  rajesh      pass              1     1.0
3     4  naveen      fail              0     0.0>